interviu/blog/app/controllers/api/v1/customs_sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT 1  [["email", "jorgeglezon@gmail.com"]]
UPDATE "users" SET "last_sign_in_at" = ?, "current_sign_in_at" = ?, "sign_in_count" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["last_sign_in_at", "2015-07-13 18:17:34.061628"], ["current_sign_in_at", "2015-07-13 18:22:04.614389"], ["sign_in_count", 3], ["updated_at", "2015-07-13 18:22:04.616013"], ["id", 1]]
---
	def create
    	user_password = params[:session][:password]
    	user_email = params[:session][:email]
    	user = user_email.present? && User.find_by(email: user_email)
      #send = User.new(:email => 'jorgeglezon@gmail.com')
      #mail = UserMailer.welcome_email(send).deliver_now
      #UserMailer.send_email().deliver_now

      if user.valid_password? user_password
      		sign_in user, store: false
      		#user.generate_authentication_token!
      		user.save