interviu/blog/app/controllers/api/v1/users_controller.rb

INSERT INTO "users" ("name", "email", "encrypted_password", "created_at", "updated_at", "confirmation_token", "confirmation_sent_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
	def create
    	user = User.new(user_params)
      #user.skip_confirmation!
    	if user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "users" SET "encrypted_password" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["encrypted_password", "$2a$10$OxgCRTB54L6xwvTU2IVRx.Nn7CTLHc0zWt.EW4S5t9/iNMU46cmjq"], ["updated_at", "2015-07-13 22:23:18.044946"], ["id", 1]]
---
  	def update
  		user = User.find(params[:id])

  		if user.update(pass_params)