app/controllers/articles_controller.rb

INSERT INTO "articles" ("title", "text", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "mi first title"], ["text", "my first body!!"], ["created_at", "2015-07-07 20:59:44.143508"], ["updated_at", "2015-07-07 20:59:44.143508"]]
---
	def create
		@article = Article.new(params.require(:article).permit(:title, :text))

		if @article.save