app/controllers/customs_sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT 1  [["email", "jorge_agl@hotmail.com"]]
UPDATE "users" SET "last_sign_in_at" = ?, "current_sign_in_at" = ?, "sign_in_count" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["last_sign_in_at", "2015-07-10 22:56:22.414390"], ["current_sign_in_at", "2015-07-10 23:20:13.032290"], ["sign_in_count", 3], ["updated_at", "2015-07-10 23:20:13.033293"], ["id", 13]]
---
	def create

    	user_password = params[:session][:password]
    	user_email = params[:session][:email]
    	user = user_email.present? && User.find_by(email: user_email)

    	if user.valid_password? user_password
      		sign_in user, store: false
      		#user.generate_authentication_token!
      		user.save